In [2]:
import matplotlib
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt


from dsutil.plotting import add_grid
from platform import python_version

In [4]:
pd.__version__, matplotlib.__version__, np.__version__, python_version()

('1.3.2', '3.4.3', '1.21.2', '3.8.10')

## union all

In [5]:
import pandas as pd

df1 = pd.DataFrame({
    'name':['john','mary'],
    'age':[24,45]
})

df2 = pd.DataFrame({
    'name':['mary','john'],
    'age':[45,89]
})

# pass dataframes as a list
pd.concat([df1,df2], ignore_index=True)

   name  age
0  john   24
1  mary   45
2  mary   45
3  john   89

## union

In [8]:
import pandas as pd

df1 = pd.DataFrame({
    'name':['john','mary'],
    'age':[24,45]
})

df2 = pd.DataFrame({
    'name':['mary','john'],
    'age':[45,89]
})

pd.concat([
    df1,df2
],ignore_index=True).drop_duplicates().reset_index(drop=True)

   name  age
0  john   24
1  mary   45
2  john   89

## concat horizontally

In [9]:
import pandas as pd

df1 = pd.DataFrame({
    'name':['john','mary'],
    'age':[24,45]
})

df2 = pd.DataFrame({
    'name':['mary','john'],
    'age':[45,89]
})

pd.concat([
    df1,df2
],axis=1)

   name  age  name  age
0  john   24  mary   45
1  mary   45  john   89